src/Enums/УсловияПредоставленияСкидокНаценок/УсловияПредоставленияСкидокНаценок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УсловияПредоставленияСкидокНаценок</name>
  <enumValues>
    <name>ЗаРазовыйОбъемПродаж</name>
  </enumValues>
  <enumValues>
    <name>ЗаНакопленныйОбъемПродаж</name>
  </enumValues>
  <enumValues>
    <name>ЗаПробнуюПродажу</name>
  </enumValues>
  <enumValues>
    <name>ЗаПервуюПродажуПартнеру</name>
  </enumValues>
  <enumValues>
    <name>ЗаВремяПродажи</name>
  </enumValues>
  <enumValues>
    <name>ЗаГрафикОплаты</name>
  </enumValues>
  <enumValues>
    <name>ЗаФормуОплаты</name>
  </enumValues>
  <enumValues>
    <name>ЗаНаличиеКартыЛояльности</name>
  </enumValues>
  <enumValues>
    <name>ОграничениеПоГруппеПользователей</name>
  </enumValues>
  <enumValues>
    <name>КартаЛояльностиНеЗарегистрирована</name>
  </enumValues>
  <enumValues>
    <name>ВхождениеПартнераВСегмент</name>
  </enumValues>
  <enumValues>
    <name>ВнешняяОбработка</name>
  </enumValues>
  <enumValues>
    <name>ЗаДеньРожденияКлиента</name>
  </enumValues>
</mdclass:Enum>

src/Enums/УсловияПредоставленияСкидокНаценок/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ИспользоватьСегментыПартнеров = ПолучитьФункциональнуюОпцию("ИспользоватьСегментыПартнеров");
	ИспользоватьКартыЛояльности = ПолучитьФункциональнуюОпцию("ИспользоватьКартыЛояльности");
	ИспользоватьГруппыПользователей = ПолучитьФункциональнуюОпцию("ИспользоватьГруппыПользователей");
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений();
	Для Каждого ТекЭлемент Из Перечисления.УсловияПредоставленияСкидокНаценок Цикл
		Если ТекЭлемент = Перечисления.УсловияПредоставленияСкидокНаценок.ВхождениеПартнераВСегмент
			И Не ИспользоватьСегментыПартнеров Тогда
			Продолжить;
		ИначеЕсли ТекЭлемент = Перечисления.УсловияПредоставленияСкидокНаценок.ЗаНаличиеКартыЛояльности
			И Не ИспользоватьКартыЛояльности Тогда
			Продолжить;
		ИначеЕсли ТекЭлемент = Перечисления.УсловияПредоставленияСкидокНаценок.КартаЛояльностиНеЗарегистрирована
			и Не ИспользоватьКартыЛояльности Тогда
			Продолжить;
		ИначеЕсли ТекЭлемент = Перечисления.УсловияПредоставленияСкидокНаценок.ОграничениеПоГруппеПользователей
			и Не ИспользоватьГруппыПользователей Тогда
			Продолжить;
		ИначеЕсли ТекЭлемент = Перечисления.УсловияПредоставленияСкидокНаценок.ЗаПробнуюПродажу
			и Не ИспользоватьСегментыПартнеров Тогда
			Продолжить;
		Иначе
			ДанныеВыбора.Добавить(ТекЭлемент);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
